# CanHaveSymbol Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormatOptions..::..CanHaveSymbol Method
FormatOptions Class See Also
---
Checks whether a symbol can be specified to display the unit in this FormatOptions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool CanHaveSymbol()
```

Visual Basic
---
```text
Public Function CanHaveSymbol As Boolean
```

Visual C++
---
```text
public:
bool CanHaveSymbol()
```

# ### Return Value
True if a symbol can be specified, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | UseDefault is true in this FormatOptions. |

# See Also
FormatOptions Class
CanHaveSymbol Overload
Autodesk.Revit.DB Namespace